[{
        "language": "React",
        "desc": "Class and functional components. React Hooks. State management and dynamic updates. Async API calls"
    }, {
        "language": "Vanilla JavaScript",
        "desc": "Event Listeners, DOM Manipulation, Object Methods, ES6 Syntax, OOP and Data Structures, Logic Programming, UI and Experience Programming"
    },
    {
        "language": "jQuery",
        "desc": "AJAX Methods, Selectors, jQuery style functions. DOM manipulation and creation."
    },
    {
        "language": "Bootstrap",
        "desc": "Using the grid system and builtin classes to quickly protype and customize responsive, user-first websites and applications."
    },
    {
        "language": "HTML & CSS",
        "desc": "When forming the backbone of the front-end experience. I look to create a HTML/CSS application which makes sense to other developers as well as to users. By keeping things modular, clear, commented and ordered."
    },
    {
        "language": "Node.js",
        "desc": "Sites I have built revolve around the Express Framework and NPM modules such as Passport, Body-Parser, EJS and others. I have created a NPM project called cls -- see project page for more detail"
    },
    {
        "language": "Python",
        "desc": " I have built a number of artistic and personal projects using Python and Flask. I am passionate about OpenCV, Flask, Tkinter, PyGame and front end frameworks to craft GUI and web apps capable of some more intense number or data crunching."
    },
    {
        "language": "SCSS",
        "desc": "Using CSS preprocessors allows me to create more complex functionality to the CSS within an app while making code more readable and functional. "
    },
    {
        "language": "Embedded Systems and IoT",
        "desc": "Through my artistic practice I have used IoT and embedded solutions for video playback, sculpture, data processing and as servers for dynamic sites. I am competent and comfortable working with and debugging these systems."
    },
    {
        "language": "Processing & p5.js",
        "desc": "Generating animations and graphics using JavaScript and Java frameworks."
    }
]